espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_eco5_struct.h
/** Type of blend_byte_order register
 *  Blending engine byte order register
 */
typedef union {
    struct {
        /** blend0_rx_byte_swap_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
         *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
         */
        uint32_t blend0_rx_byte_swap_en:1;
        /** blend1_rx_byte_swap_en : R/W; bitpos: [1]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
         *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
         */
        uint32_t blend1_rx_byte_swap_en:1;
        /** blend0_rx_rgb_swap_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
         *  would be swap to bgr.
         */
        uint32_t blend0_rx_rgb_swap_en:1;
        /** blend1_rx_rgb_swap_en : R/W; bitpos: [3]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
         *  would be swap to bgr.
         */
        uint32_t blend1_rx_rgb_swap_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_blend_byte_order_reg_t;

/** Type of blend_trans_mode register
 *  Blending engine mode configure register
 */
typedef union {
    struct {
        /** blend_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable alpha blending.
         */
        uint32_t blend_en:1;
        /** blend_bypass : R/W; bitpos: [1]; default: 0;
         *  Set this bit to bypass blender. Then background date would be output.
         */
        uint32_t blend_bypass:1;
        /** blend_fix_pixel_fill_en : R/W; bitpos: [2]; default: 0;
         *  This bit is used to enable fix pixel filling. When this mode is enable  only Tx
         *  channel is work and the output pixel is configured by PPA_OUT_FIX_PIXEL.
         */
        uint32_t blend_fix_pixel_fill_en:1;
        /** blend_trans_mode_update : WT; bitpos: [3]; default: 0;
         *  Set this bit to update the transfer mode. Only the bit is set  the transfer mode is
         *  valid.
         */
        uint32_t blend_trans_mode_update:1;
        /** blend_rst : R/W; bitpos: [4]; default: 0;
         *  write 1 then write 0 to reset blending engine.
         */
        uint32_t blend_rst:1;
        /** blend_tx_inf_sel : R/W; bitpos: [6:5]; default: 0;
         *  unused ! Configures blend tx interface. 0: dma2d only, 1: le_enc only, 2: dma2d and
         *  ls_enc
         */
        uint32_t blend_tx_inf_sel:2;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ppa_blend_trans_mode_reg_t;

/** Type of sr_fix_alpha register
 *  Scaling and rotating engine alpha override register
 */
typedef union {
    struct {
        /** sr_rx_fix_alpha : R/W; bitpos: [7:0]; default: 128;
         *  The value would replace the alpha value in received pixel for Scaling and Rotating
         *  engine when PPA_SR_RX_ALPHA_CONF_EN is enabled.
         */
        uint32_t sr_rx_fix_alpha:8;
        /** sr_rx_alpha_mod : R/W; bitpos: [9:8]; default: 0;
         *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_SR_FIX_ALPHA. 2:
         *  Original alpha multiply with PPA_SR_FIX_ALPHA/256.
         */
        uint32_t sr_rx_alpha_mod:2;
        /** sr_rx_alpha_inv : R/W; bitpos: [10]; default: 0;
         *  Set this bit to invert the original alpha value. When RX color mode is
         *  RGB565/RGB88. The original alpha value is 255.
         */
        uint32_t sr_rx_alpha_inv:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} ppa_sr_fix_alpha_reg_t;

/** Type of blend_tx_size register
 *  Fix pixel filling mode image size register
 */
typedef union {
    struct {
        /** blend_hb : R/W; bitpos: [13:0]; default: 0;
         *  The horizontal width of image block that would be filled in fix pixel filling mode
         *  or blend mode. The unit is pixel. Must be even num when YUV422 or YUV420
         */
        uint32_t blend_hb:14;
        /** blend_vb : R/W; bitpos: [27:14]; default: 0;
         *  The vertical width of image block that would be filled in fix pixel filling mode or
         *  blend mode. The unit is pixel. Must be even num when YUV420
         */
        uint32_t blend_vb:14;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ppa_blend_tx_size_reg_t;

/** Type of blend_fix_alpha register
 *  Blending engine alpha override register
 */
typedef union {
    struct {
        /** blend0_rx_fix_alpha : R/W; bitpos: [7:0]; default: 128;
         *  The value would replace the alpha value in received pixel for background plane of
         *  blender when PPA_BLEND0_RX_ALPHA_CONF_EN is enabled.
         */
        uint32_t blend0_rx_fix_alpha:8;
        /** blend1_rx_fix_alpha : R/W; bitpos: [15:8]; default: 128;
         *  The value would replace the alpha value in received pixel for foreground plane of
         *  blender when PPA_BLEND1_RX_ALPHA_CONF_EN is enabled.
         */
        uint32_t blend1_rx_fix_alpha:8;
        /** blend0_rx_alpha_mod : R/W; bitpos: [17:16]; default: 0;
         *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_BLEND0_FIX_ALPHA. 2:
         *  Original alpha multiply with PPA_SR_FIX_ALPHA/256.
         */
        uint32_t blend0_rx_alpha_mod:2;
        /** blend1_rx_alpha_mod : R/W; bitpos: [19:18]; default: 0;
         *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_BLEND1_FIX_ALPHA. 2:
         *  Original alpha multiply with PPA_SR_FIX_ALPHA/256.
         */
        uint32_t blend1_rx_alpha_mod:2;
        /** blend0_rx_alpha_inv : R/W; bitpos: [20]; default: 0;
         *  Set this bit to invert the original alpha value. When RX color mode is
         *  RGB565/RGB88. The original alpha value is 255.
         */
        uint32_t blend0_rx_alpha_inv:1;
        /** blend1_rx_alpha_inv : R/W; bitpos: [21]; default: 0;
         *  Set this bit to invert the original alpha value. When RX color mode is
         *  RGB565/RGB88. The original alpha value is 255.
         */
        uint32_t blend1_rx_alpha_inv:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} ppa_blend_fix_alpha_reg_t;

/** Type of blend_rgb register
 *  RGB color register
 */
typedef union {
    struct {
        /** blend1_rx_b : R/W; bitpos: [7:0]; default: 128;
         *  blue color for A4/A8 mode.
         */
        uint32_t blend1_rx_b:8;
        /** blend1_rx_g : R/W; bitpos: [15:8]; default: 128;
         *  green color for A4/A8 mode.
         */
        uint32_t blend1_rx_g:8;
        /** blend1_rx_r : R/W; bitpos: [23:16]; default: 128;
         *  red color for A4/A8 mode.
         */
        uint32_t blend1_rx_r:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_blend_rgb_reg_t;

